results/data/benchclient1/quarkus-io-thread-10000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 0.974ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.037ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.995ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01ms  445.53us   4.58ms   61.45%
    Req/Sec     2.64k   337.54     4.22k    82.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.36ms
 90.000%    1.59ms
 99.000%    1.96ms
 99.900%    2.25ms
 99.990%    2.64ms
 99.999%    4.38ms
100.000%    4.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.080     0.000000            1         1.00
       0.413     0.100000        50150         1.11
       0.562     0.200000       100077         1.25
       0.709     0.300000       149871         1.43
       0.859     0.400000       199515         1.67
       1.007     0.500000       249721         2.00
       1.080     0.550000       274468         2.22
       1.153     0.600000       299300         2.50
       1.226     0.650000       324406         2.86
       1.296     0.700000       349261         3.33
       1.364     0.750000       374134         4.00
       1.399     0.775000       386627         4.44
       1.434     0.800000       399132         5.00
       1.470     0.825000       411642         5.71
       1.508     0.850000       424088         6.67
       1.548     0.875000       436434         8.00
       1.570     0.887500       442830         8.89
       1.593     0.900000       449121        10.00
       1.617     0.912500       455137        11.43
       1.646     0.925000       461493        13.33
       1.677     0.937500       467647        16.00
       1.695     0.943750       470781        17.78
       1.715     0.950000       473945        20.00
       1.736     0.956250       477016        22.86
       1.760     0.962500       480079        26.67
       1.788     0.968750       483177        32.00
       1.806     0.971875       484815        35.56
       1.823     0.975000       486339        40.00
       1.843     0.978125       487881        45.71
       1.867     0.981250       489457        53.33
       1.893     0.984375       490979        64.00
       1.908     0.985938       491742        71.11
       1.927     0.987500       492548        80.00
       1.947     0.989062       493310        91.43
       1.968     0.990625       494088       106.67
       1.992     0.992188       494852       128.00
       2.007     0.992969       495256       142.22
       2.024     0.993750       495651       160.00
       2.043     0.994531       496030       182.86
       2.065     0.995313       496457       213.33
       2.087     0.996094       496831       256.00
       2.101     0.996484       497006       284.44
       2.115     0.996875       497191       320.00
       2.133     0.997266       497388       365.71
       2.153     0.997656       497602       426.67
       2.173     0.998047       497788       512.00
       2.185     0.998242       497879       568.89
       2.197     0.998437       497972       640.00
       2.215     0.998633       498076       731.43
       2.233     0.998828       498166       853.33
       2.253     0.999023       498263      1024.00
       2.267     0.999121       498313      1137.78
       2.283     0.999219       498362      1280.00
       2.309     0.999316       498409      1462.86
       2.329     0.999414       498457      1706.67
       2.359     0.999512       498506      2048.00
       2.373     0.999561       498530      2275.56
       2.393     0.999609       498556      2560.00
       2.413     0.999658       498578      2925.71
       2.435     0.999707       498606      3413.33
       2.461     0.999756       498630      4096.00
       2.471     0.999780       498639      4551.11
       2.493     0.999805       498653      5120.00
       2.517     0.999829       498663      5851.43
       2.549     0.999854       498675      6826.67
       2.601     0.999878       498688      8192.00
       2.631     0.999890       498694      9102.22
       2.667     0.999902       498700     10240.00
       2.719     0.999915       498706     11702.86
       2.859     0.999927       498712     13653.33
       3.495     0.999939       498718     16384.00
       3.549     0.999945       498721     18204.44
       3.685     0.999951       498724     20480.00
       3.741     0.999957       498727     23405.71
       3.845     0.999963       498730     27306.67
       3.867     0.999969       498733     32768.00
       4.061     0.999973       498735     36408.89
       4.135     0.999976       498736     40960.00
       4.163     0.999979       498738     46811.43
       4.219     0.999982       498739     54613.33
       4.339     0.999985       498741     65536.00
       4.363     0.999986       498742     72817.78
       4.363     0.999988       498742     81920.00
       4.379     0.999989       498743     93622.86
       4.395     0.999991       498744    109226.67
       4.443     0.999992       498745    131072.00
       4.443     0.999993       498745    145635.56
       4.443     0.999994       498745    163840.00
       4.495     0.999995       498746    187245.71
       4.495     0.999995       498746    218453.33
       4.555     0.999996       498747    262144.00
       4.555     0.999997       498747    291271.11
       4.555     0.999997       498747    327680.00
       4.555     0.999997       498747    374491.43
       4.555     0.999998       498747    436906.67
       4.587     0.999998       498748    524288.00
       4.587     1.000000       498748          inf
#[Mean    =        1.009, StdDeviation   =        0.446]
#[Max     =        4.584, Total count    =       498748]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599434 requests in 1.00m, 29.73MB read
Requests/sec:   9990.22
Transfer/sec:    507.32KB