results/data/benchclient1/quarkus-io-thread-122000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 16.213ms, rate sampling interval: 77ms
  Thread calibration: mean lat.: 16.486ms, rate sampling interval: 78ms
  Thread calibration: mean lat.: 15.876ms, rate sampling interval: 77ms
  Thread calibration: mean lat.: 15.699ms, rate sampling interval: 76ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.88ms    9.66ms  75.71ms   79.34%
    Req/Sec    30.70k     4.69k   42.00k    60.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.85ms
 75.000%   16.48ms
 90.000%   23.87ms
 99.000%   33.79ms
 99.900%   39.10ms
 99.990%   43.78ms
 99.999%   61.76ms
100.000%   75.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.043     0.000000            1         1.00
       0.586     0.100000       608842         1.11
       0.925     0.200000      1218530         1.25
       1.264     0.300000      1826878         1.43
       1.741     0.400000      2433878         1.67
       2.851     0.500000      3042471         2.00
       5.507     0.550000      3346650         2.22
       8.479     0.600000      3650780         2.50
      11.311     0.650000      3955430         2.86
      13.967     0.700000      4259696         3.33
      16.479     0.750000      4564520         4.00
      17.679     0.775000      4716695         4.44
      18.863     0.800000      4868053         5.00
      20.047     0.825000      5020473         5.71
      21.247     0.850000      5173072         6.67
      22.495     0.875000      5324292         8.00
      23.167     0.887500      5401060         8.89
      23.871     0.900000      5476339        10.00
      24.655     0.912500      5552812        11.43
      25.503     0.925000      5628559        13.33
      26.447     0.937500      5704926        16.00
      26.959     0.943750      5742408        17.78
      27.519     0.950000      5780314        20.00
      28.143     0.956250      5818302        22.86
      28.831     0.962500      5856198        26.67
      29.631     0.968750      5894580        32.00
      30.063     0.971875      5913320        35.56
      30.543     0.975000      5932606        40.00
      31.055     0.978125      5951374        45.71
      31.631     0.981250      5970256        53.33
      32.287     0.984375      5989295        64.00
      32.655     0.985938      5998959        71.11
      33.055     0.987500      6008499        80.00
      33.503     0.989062      6018066        91.43
      33.983     0.990625      6027511       106.67
      34.527     0.992188      6036831       128.00
      34.847     0.992969      6041793       142.22
      35.167     0.993750      6046317       160.00
      35.551     0.994531      6051254       182.86
      35.935     0.995313      6055800       213.33
      36.415     0.996094      6060701       256.00
      36.671     0.996484      6063067       284.44
      36.959     0.996875      6065533       320.00
      37.247     0.997266      6067837       365.71
      37.567     0.997656      6070131       426.67
      37.919     0.998047      6072440       512.00
      38.111     0.998242      6073620       568.89
      38.335     0.998437      6074867       640.00
      38.559     0.998633      6076022       731.43
      38.815     0.998828      6077175       853.33
      39.167     0.999023      6078446      1024.00
      39.359     0.999121      6079033      1137.78
      39.551     0.999219      6079557      1280.00
      39.807     0.999316      6080167      1462.86
      40.095     0.999414      6080789      1706.67
      40.383     0.999512      6081338      2048.00
      40.575     0.999561      6081620      2275.56
      40.799     0.999609      6081951      2560.00
      41.023     0.999658      6082223      2925.71
      41.279     0.999707      6082524      3413.33
      41.599     0.999756      6082820      4096.00
      41.791     0.999780      6082981      4551.11
      41.983     0.999805      6083121      5120.00
      42.175     0.999829      6083254      5851.43
      42.495     0.999854      6083407      6826.67
      43.039     0.999878      6083553      8192.00
      43.455     0.999890      6083627      9102.22
      43.839     0.999902      6083702     10240.00
      44.383     0.999915      6083775     11702.86
      45.439     0.999927      6083848     13653.33
      46.751     0.999939      6083922     16384.00
      47.519     0.999945      6083959     18204.44
      48.575     0.999951      6083996     20480.00
      49.855     0.999957      6084034     23405.71
      51.391     0.999963      6084072     27306.67
      53.311     0.999969      6084108     32768.00
      54.111     0.999973      6084126     36408.89
      55.711     0.999976      6084145     40960.00
      56.927     0.999979      6084165     46811.43
      58.335     0.999982      6084182     54613.33
      59.647     0.999985      6084201     65536.00
      60.191     0.999986      6084211     72817.78
      60.607     0.999988      6084219     81920.00
      61.375     0.999989      6084229     93622.86
      62.239     0.999991      6084238    109226.67
      63.551     0.999992      6084248    131072.00
      64.575     0.999993      6084253    145635.56
      65.663     0.999994      6084257    163840.00
      66.687     0.999995      6084261    187245.71
      67.839     0.999995      6084266    218453.33
      68.927     0.999996      6084270    262144.00
      69.439     0.999997      6084274    291271.11
      69.695     0.999997      6084275    327680.00
      70.079     0.999997      6084277    374491.43
      70.975     0.999998      6084280    436906.67
      71.359     0.999998      6084282    524288.00
      71.743     0.999998      6084283    582542.22
      72.255     0.999998      6084284    655360.00
      72.895     0.999999      6084285    748982.86
      73.983     0.999999      6084287    873813.33
      74.367     0.999999      6084288   1048576.00
      74.367     0.999999      6084288   1165084.44
      74.687     0.999999      6084289   1310720.00
      74.687     0.999999      6084289   1497965.71
      75.007     0.999999      6084290   1747626.67
      75.199     1.000000      6084291   2097152.00
      75.199     1.000000      6084291   2330168.89
      75.199     1.000000      6084291   2621440.00
      75.199     1.000000      6084291   2995931.43
      75.327     1.000000      6084292   3495253.33
      75.327     1.000000      6084292   4194304.00
      75.327     1.000000      6084292   4660337.78
      75.327     1.000000      6084292   5242880.00
      75.327     1.000000      6084292   5991862.86
      75.775     1.000000      6084293   6990506.67
      75.775     1.000000      6084293          inf
#[Mean    =        8.884, StdDeviation   =        9.656]
#[Max     =       75.712, Total count    =      6084293]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7312144 requests in 1.00m, 362.62MB read
Requests/sec: 121871.03
Transfer/sec:      6.04MB