results/data/benchclient1/quarkus-io-thread-122000-WARM-UP.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 5.777ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 5.759ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 5.785ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 5.819ms, rate sampling interval: 37ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.23ms    7.52ms  43.81ms   80.41%
    Req/Sec    30.91k     9.66k   57.44k    63.25%
  7309503 requests in 1.00m, 362.49MB read
Requests/sec: 121826.50
Transfer/sec:      6.04MB